from enum import Enum

UP = 273
DOWN = 274
RIGHT = 275
LEFT = 276
ARROWS = [UP, DOWN, RIGHT, LEFT]

SPACE = 32
ENTER = 13
ESC = 27
DEL = 127
BK_SPACE = 8

LANGUAGES = {
    'EN': 0,
    'HE': 1
}

LETTERS_EN = {
    113: 'Q',
    119: 'W',
    101: 'E',
    114: 'R',
    116: 'T',
    121: 'Y',
    117: 'U',
    105: 'I',
    111: 'O',
    112: 'P',
    97: 'A',
    115: 'S',
    100: 'D',
    102: 'F',
    103: 'G',
    104: 'H',
    106: 'J',
    107: 'K',
    108: 'L',
    122: 'Z',
    120: 'X',
    99: 'C',
    118: 'V',
    98: 'B',
    110: 'N',
    109: 'M',
}

LETTERS_HE = {
    101: 'ק',
    114: 'ר',
    116: 'א',
    121: 'ט',
    117: 'ו',
    105: 'ן',
    112: 'פ',
    97: 'ש',
    115: 'ד',
    100: 'ג',
    102: 'כ',
    103: 'ע',
    104: 'י',
    106: 'ח',
    107: 'ל',
    108: 'ך',
    122: 'ז',
    120: 'ס',
    99: 'ב',
    118: 'ה',
    98: 'נ',
    110: 'מ',
    109: 'צ',
    44: 'ת'
}


class Languages(Enum):
    EN = 1
    HE = 2
